In [408]:
import pandas as pd

marksUT = {
    "Name": [
        "Raman",
        "Raman",
        "Raman",
        "Zuhaire",
        "Zuhaire",
        "Zuhaire",
        "Ashravy",
        "Ashravy",
        "Ashravy",
        "Mishti",
        "Mishti",
        "Mishti",
    ],
    "UT": [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3],
    "Maths": [22, 21, 14, 20, 23, 22, 23, 24, 12, 15, 18, 17],
    "Science": [21, 20, 19, 17, 15, 18, 19, 22, 25, 22, 21, 18],
    "S.St": [18, 17, 15, 22, 21, 19, 20, 24, 19, 25, 25, 20],
    "Hindi": [20, 22, 24, 24, 25, 23, 15, 17, 21, 22, 24, 25],
    "Eng": [21, 24, 23, 19, 15, 13, 22, 21, 23, 22, 23, 20],
}

df = pd.DataFrame(marksUT)
print(df)

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

In [409]:
print(df.max())

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object

In [410]:
print(df.max(numeric_only=True))

UT          3
Maths      24
Science    25
S.St       25
Hindi      25
Eng        24
dtype: int64

In [411]:
dfUT2 = df[df.UT == 2]
print("Result of Unit Test 2:\n")
print(dfUT2)

Result of Unit Test 2:

       Name  UT  Maths  Science  S.St  Hindi  Eng
1     Raman   2     21       20    17     22   24
4   Zuhaire   2     23       15    21     25   15
7   Ashravy   2     24       22    24     17   21
10   Mishti   2     18       21    25     24   23

In [412]:
print("Maximum Mark obtained inEach Subject in Unit Test 2:\n")
print(dfUT2.max(numeric_only=True))

Maximum Mark obtained inEach Subject in Unit Test 2:

UT          2
Maths      24
Science    22
S.St       25
Hindi      25
Eng        24
dtype: int64

In [413]:
dfUT2 = df[df["UT"] == 2].max(numeric_only=True)
print(dfUT2)

UT          2
Maths      24
Science    22
S.St       25
Hindi      25
Eng        24
dtype: int64

In [414]:
# maximum marks for each student in each unit test among all the subjects
df.max(axis=1, numeric_only=True)

0     22
1     24
2     24
3     24
4     25
5     23
6     23
7     24
8     25
9     25
10    25
11    25
dtype: int64

In [415]:
print(df.min())

Name       Ashravy
UT               1
Maths           12
Science         15
S.St            15
Hindi           15
Eng             13
dtype: object

In [416]:
dfMishti = df.loc[df.Name == "Mishti"]
print("Marks obtained by Mishti in allthe Unit Tests:\n")
print(dfMishti)

Marks obtained by Mishti in allthe Unit Tests:

      Name  UT  Maths  Science  S.St  Hindi  Eng
9   Mishti   1     15       22    25     22   22
10  Mishti   2     18       21    25     24   23
11  Mishti   3     17       18    20     25   20

In [417]:
print("Minimum Marks obtained by Mishti in each subject across the unit tests:\n")
print(dfMishti[["Maths", "Science", "S.St", "Hindi", "Eng"]].min())

Minimum Marks obtained by Mishti in each subject across the unit tests:

Maths      15
Science    18
S.St       20
Hindi      22
Eng        20
dtype: int64

In [418]:
dfMishti = df[
    [
        "Maths",
        "Science",
        "S.St",
        "Hindi",
        "Eng",
    ]
][df.Name == "Mishti"].min()

print(dfMishti)

Maths      15
Science    18
S.St       20
Hindi      22
Eng        20
dtype: int64

In [419]:
print(df.sum())

Name       RamanRamanRamanZuhaireZuhaireZuhaireAshravyAsh...
UT                                                        24
Maths                                                    231
Science                                                  237
S.St                                                     245
Hindi                                                    262
Eng                                                      246
dtype: object

In [420]:
print(df["Maths"].sum())

231

In [421]:
dfRaman = df[df["Name"] == "Raman"]
print("Marks obtained by Raman in each test are:\n")
print(dfRaman)

Marks obtained by Raman in each test are:

    Name  UT  Maths  Science  S.St  Hindi  Eng
0  Raman   1     22       21    18     20   21
1  Raman   2     21       20    17     22   24
2  Raman   3     14       19    15     24   23

In [422]:
dfRaman[
    [
        "Maths",
        "Science",
        "S.St",
        "Hindi",
        "Eng",
    ]
].sum()

Maths      57
Science    60
S.St       50
Hindi      66
Eng        68
dtype: int64

In [423]:
# To print total marks scored by Raman
# in all subjects in each Unit Test
dfRaman[
    [
        "Maths",
        "Science",
        "S.St",
        "Hindi",
        "Eng",
    ]
].sum(axis=1)

0    102
1    104
2     95
dtype: int64

In [424]:
print(df.count())

Name       12
UT         12
Maths      12
Science    12
S.St       12
Hindi      12
Eng        12
dtype: int64

In [425]:
df.count(axis=1)

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
dtype: int64

In [426]:
df.mean(numeric_only=True)

UT          2.000000
Maths      19.250000
Science    19.750000
S.St       20.416667
Hindi      21.833333
Eng        20.500000
dtype: float64

In [427]:
dfZuhaire = df[df.Name == "Zuhaire"]

dfZuhaireMarks = dfZuhaire.loc[:, "Maths":"Eng"]
print("Slicing of the DataFrame to get only the marks:\n")
print(dfZuhaireMarks)

Slicing of the DataFrame to get only the marks:

   Maths  Science  S.St  Hindi  Eng
3     20       17    22     24   19
4     23       15    21     25   15
5     22       18    19     23   13

In [428]:
print("Average of marks obtained by Zuhaire in all Unit Tests:\n")
print(dfZuhaireMarks.mean(axis=1))

Average of marks obtained by Zuhaire in all Unit Tests:

3    20.4
4    19.8
5    19.0
dtype: float64

In [429]:
print(df.median(numeric_only=True))

UT          2.0
Maths      20.5
Science    19.5
S.St       20.0
Hindi      22.5
Eng        21.5
dtype: float64

In [430]:
dfMaths = df["Maths"]
dfMathsUT1 = dfMaths[df.UT == 1]

print("Displaying the marks scored in Mathematics in UT1:\n")
print(dfMathsUT1)

Displaying the marks scored in Mathematics in UT1:

0    22
3    20
6    23
9    15
Name: Maths, dtype: int64

In [431]:
dfMathMedian = dfMathsUT1.median()

print("Displaying the median of Mathematics in UT1:\n")
print(dfMathMedian)

Displaying the median of Mathematics in UT1:

21.0

In [432]:
df["Hindi"]

0     20
1     22
2     24
3     24
4     25
5     23
6     15
7     17
8     21
9     22
10    24
11    25
Name: Hindi, dtype: int64

In [433]:
df["Hindi"].mode()

0    24
Name: Hindi, dtype: int64

In [434]:
df.quantile(numeric_only=True)  # by default, median is the output

UT          2.0
Maths      20.5
Science    19.5
S.St       20.0
Hindi      22.5
Eng        21.5
Name: 0.5, dtype: float64

In [435]:
df.quantile(q=0.25, numeric_only=True)

UT          1.00
Maths      16.50
Science    18.00
S.St       18.75
Hindi      20.75
Eng        19.75
Name: 0.25, dtype: float64

In [436]:
df.quantile(q=0.75, numeric_only=True)

UT          3.00
Maths      22.25
Science    21.25
S.St       22.50
Hindi      24.00
Eng        23.00
Name: 0.75, dtype: float64

In [437]:
dfSubject = df[["Maths", "Science", "S.St", "Hindi", "Eng"]]

print("Marks of all the subjects:\n")
print(dfSubject)

Marks of all the subjects:

    Maths  Science  S.St  Hindi  Eng
0      22       21    18     20   21
1      21       20    17     22   24
2      14       19    15     24   23
3      20       17    22     24   19
4      23       15    21     25   15
5      22       18    19     23   13
6      23       19    20     15   22
7      24       22    24     17   21
8      12       25    19     21   23
9      15       22    25     22   22
10     18       21    25     24   23
11     17       18    20     25   20

In [438]:
dfQ = dfSubject.quantile([0.25, 0.75])

print("First and third quartiles of all the subjects:\n")
print(dfQ)

First and third quartiles of all the subjects:

      Maths  Science   S.St  Hindi    Eng
0.25  16.50    18.00  18.75  20.75  19.75
0.75  22.25    21.25  22.50  24.00  23.00

In [439]:
df[["Maths", "Science", "S.St", "Hindi", "Eng"]].var()

Maths      15.840909
Science     7.113636
S.St        9.901515
Hindi       9.969697
Eng        11.363636
dtype: float64

In [440]:
df[["Maths", "Science", "S.St", "Hindi", "Eng"]].std()

Maths      3.980064
Science    2.667140
S.St       3.146667
Hindi      3.157483
Eng        3.370999
dtype: float64

In [441]:
df.describe()

              UT      Maths   Science       S.St      Hindi        Eng
count  12.000000  12.000000  12.00000  12.000000  12.000000  12.000000
mean    2.000000  19.250000  19.75000  20.416667  21.833333  20.500000
std     0.852803   3.980064   2.66714   3.146667   3.157483   3.370999
min     1.000000  12.000000  15.00000  15.000000  15.000000  13.000000
25%     1.000000  16.500000  18.00000  18.750000  20.750000  19.750000
50%     2.000000  20.500000  19.50000  20.000000  22.500000  21.500000
75%     3.000000  22.250000  21.25000  22.500000  24.000000  23.000000
max     3.000000  24.000000  25.00000  25.000000  25.000000  24.000000

In [442]:
df.aggregate("max")

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object

In [443]:
# To use multiple aggregate functions in asingle statement
df.aggregate(["max", "count"])

          Name  UT  Maths  Science  S.St  Hindi  Eng
max    Zuhaire   3     24       25    25     25   24
count       12  12     12       12    12     12   12

In [444]:
df["Maths"].aggregate(["max", "min"])

max    24
min    12
Name: Maths, dtype: int64

In [445]:
# Using the above statement with axis=0 givesthe same result
df["Maths"].aggregate(["max", "min"], axis=0)

max    24
min    12
Name: Maths, dtype: int64

In [446]:
# Total marks of Maths and Science obtained byeach student.
# Use sum() with axis=1 (Row-wise summation)
df[["Maths", "Science"]].aggregate("sum", axis=1)

0     43
1     41
2     33
3     37
4     38
5     40
6     42
7     46
8     37
9     37
10    39
11    35
dtype: int64

```py
DataFrame.sort_values(by, axis=0, ascending=True)
```

In [447]:
# By default, sorting is done in ascending order.
print(df.sort_values(by=["Name"]))

       Name  UT  Maths  Science  S.St  Hindi  Eng
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13

In [448]:
# Get the data corresponding to Unit Test 2
dfUT2 = df[df.UT == 2]

# Sort according to ascending order of marks in Science
print(dfUT2.sort_values(by=["Science"]))

       Name  UT  Maths  Science  S.St  Hindi  Eng
4   Zuhaire   2     23       15    21     25   15
1     Raman   2     21       20    17     22   24
10   Mishti   2     18       21    25     24   23
7   Ashravy   2     24       22    24     17   21

In [449]:
# Get the data corresponding to Unit Test 3
dfUT3 = df[df.UT == 3]

# Sort according to descending order of marks in English
print(dfUT3.sort_values(by=["Eng"], ascending=False))

       Name  UT  Maths  Science  S.St  Hindi  Eng
2     Raman   3     14       19    15     24   23
8   Ashravy   3     12       25    19     21   23
11   Mishti   3     17       18    20     25   20
5   Zuhaire   3     22       18    19     23   13

In [450]:
# Get the data corresponding to marks in Unit Test3
dfUT3 = df[df.UT == 3]

# Sort the data according to Science and then according to Hindi
print(dfUT3.sort_values(by=["Science", "Hindi"]))

       Name  UT  Maths  Science  S.St  Hindi  Eng
5   Zuhaire   3     22       18    19     23   13
11   Mishti   3     17       18    20     25   20
2     Raman   3     14       19    15     24   23
8   Ashravy   3     12       25    19     21   23

In [451]:
# Create a groupby Name of the student from DataFrame df
g1 = df.groupby("Name")
# Displaying the first entry from each group
g1.first()

         UT  Maths  Science  S.St  Hindi  Eng
Name
Ashravy   1     23       19    20     15   22
Mishti    1     15       22    25     22   22
Raman     1     22       21    18     20   21
Zuhaire   1     20       17    22     24   19

In [452]:
# Displaying the size of each group
g1.size()

Name
Ashravy    3
Mishti     3
Raman      3
Zuhaire    3
dtype: int64

In [453]:
g1.groups

{'Ashravy': [6, 7, 8], 'Mishti': [9, 10, 11], 'Raman': [0, 1, 2], 'Zuhaire': [3, 4, 5]}

In [454]:
# Printing data of a single group
g1.get_group("Raman")

    Name  UT  Maths  Science  S.St  Hindi  Eng
0  Raman   1     22       21    18     20   21
1  Raman   2     21       20    17     22   24
2  Raman   3     14       19    15     24   23

In [455]:
# Grouping with respect to multiple attributes
# Creating a groupby Name and UT
g2 = df.groupby(["Name", "UT"])
g2.first()

            Maths  Science  S.St  Hindi  Eng
Name    UT
Ashravy 1      23       19    20     15   22
        2      24       22    24     17   21
        3      12       25    19     21   23
Mishti  1      15       22    25     22   22
        2      18       21    25     24   23
        3      17       18    20     25   20
Raman   1      22       21    18     20   21
        2      21       20    17     22   24
        3      14       19    15     24   23
Zuhaire 1      20       17    22     24   19
        2      23       15    21     25   15
        3      22       18    19     23   13

In [456]:
# Calculating average marks scored by all
# students in each subject for each UT
df.groupby(["UT"]).aggregate("mean", numeric_only=True)

    Maths  Science   S.St  Hindi    Eng
UT
1   20.00    19.75  21.25  20.25  21.00
2   21.50    19.50  21.75  22.00  20.75
3   16.25    20.00  18.25  23.25  19.75

In [457]:
# Calculate average marks scored in Maths ineach UT
group1 = df.groupby(["UT"])
group1["Maths"].aggregate("mean")

UT
1    20.00
2    21.50
3    16.25
Name: Maths, dtype: float64

In [458]:
df.groupby(by="Name")["Maths"].agg(
    ["mean", "var", "std", "quantile"],
)

              mean        var       std  quantile
Name
Ashravy  19.666667  44.333333  6.658328      23.0
Mishti   16.666667   2.333333  1.527525      17.0
Raman    19.000000  19.000000  4.358899      21.0
Zuhaire  21.666667   2.333333  1.527525      22.0

In [459]:
df  # With default Index

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

In [460]:
dfUT1 = df[df.UT == 1]
print(dfUT1)

      Name  UT  Maths  Science  S.St  Hindi  Eng
0    Raman   1     22       21    18     20   21
3  Zuhaire   1     20       17    22     24   19
6  Ashravy   1     23       19    20     15   22
9   Mishti   1     15       22    25     22   22

In [461]:
dfUT1.reset_index(inplace=True)
print(dfUT1)

   index     Name  UT  Maths  Science  S.St  Hindi  Eng
0      0    Raman   1     22       21    18     20   21
1      3  Zuhaire   1     20       17    22     24   19
2      6  Ashravy   1     23       19    20     15   22
3      9   Mishti   1     15       22    25     22   22

In [462]:
dfUT1.drop(columns=["index"], inplace=True)
print(dfUT1)

      Name  UT  Maths  Science  S.St  Hindi  Eng
0    Raman   1     22       21    18     20   21
1  Zuhaire   1     20       17    22     24   19
2  Ashravy   1     23       19    20     15   22
3   Mishti   1     15       22    25     22   22

C:\Users\laksh\AppData\Local\Temp\ipykernel_16444\399177450.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfUT1.drop(columns=["index"], inplace=True)

In [463]:
dfUT1.set_index("Name", inplace=True)
print(dfUT1)

         UT  Maths  Science  S.St  Hindi  Eng
Name
Raman     1     22       21    18     20   21
Zuhaire   1     20       17    22     24   19
Ashravy   1     23       19    20     15   22
Mishti    1     15       22    25     22   22

In [464]:
dfUT1.reset_index("Name", inplace=True)
print(dfUT1)

      Name  UT  Maths  Science  S.St  Hindi  Eng
0    Raman   1     22       21    18     20   21
1  Zuhaire   1     20       17    22     24   19
2  Ashravy   1     23       19    20     15   22
3   Mishti   1     15       22    25     22   22

In [465]:
import pandas as pd

data = {
    "Store": ["S1", "S4", "S3", "S1", "S2", "S3", "S1", "S2", "S3"],
    "Year": [2016, 2016, 2016, 2017, 2017, 2017, 2018, 2018, 2018],
    "Total_sales(Rs)": [
        12000,
        330000,
        420000,
        20000,
        10000,
        450000,
        30000,
        11000,
        89000,
    ],
    "Total_profit(Rs)": [
        1100,
        5500,
        21000,
        32000,
        9000,
        45000,
        3000,
        1900,
        23000,
    ],
}

df = pd.DataFrame(data)
print(df)

  Store  Year  Total_sales(Rs)  Total_profit(Rs)
0    S1  2016            12000              1100
1    S4  2016           330000              5500
2    S3  2016           420000             21000
3    S1  2017            20000             32000
4    S2  2017            10000              9000
5    S3  2017           450000             45000
6    S1  2018            30000              3000
7    S2  2018            11000              1900
8    S3  2018            89000             23000

In [466]:
# will get the data related to store S1
S1df = df[df.Store == "S1"]
# find the total of sales for Store S1
S1df["Total_sales(Rs)"].sum()

np.int64(62000)

In [467]:
# will get the data related to store S3
S3df = df[df.Store == "S3"]
# find the maximum sale for Store S3
S3df["Total_sales(Rs)"].max()

np.int64(450000)

In [468]:
S1df = df[df.Store == "S1"]
S2df = df[df.Store == "S2"]
S3df = df[df.Store == "S3"]
S4df = df[df.Store == "S4"]
S1total = S1df["Total_sales(Rs)"].sum()
S2total = S2df["Total_sales(Rs)"].sum()
S3total = S3df["Total_sales(Rs)"].sum()
S4total = S4df["Total_sales(Rs)"].sum()
max(S1total, S2total, S3total, S4total)

np.int64(959000)

In [469]:
pivot1 = df.pivot(
    index="Store",
    columns="Year",
    values="Total_sales(Rs)",
)

In [470]:
print(pivot1)

Year       2016      2017     2018
Store
S1      12000.0   20000.0  30000.0
S2          NaN   10000.0  11000.0
S3     420000.0  450000.0  89000.0
S4     330000.0       NaN      NaN

In [471]:
pivot1.loc["S1"].sum()

np.float64(62000.0)

In [472]:
pivot1.loc["S3"].max()

np.float64(450000.0)

In [473]:
S1total = pivot1.loc["S1"].sum()
S2total = pivot1.loc["S2"].sum()
S3total = pivot1.loc["S3"].sum()
S4total = pivot1.loc["S4"].sum()
max(S1total, S2total, S3total, S4total)

np.float64(959000.0)

In [474]:
pivot2 = df.pivot(
    index="Store",
    columns="Year",
    values=["Total_sales(Rs)", "Total_profit(Rs)"],
)
print(pivot2)

      Total_sales(Rs)                    Total_profit(Rs)
Year             2016      2017     2018             2016     2017     2018
Store
S1            12000.0   20000.0  30000.0           1100.0  32000.0   3000.0
S2                NaN   10000.0  11000.0              NaN   9000.0   1900.0
S3           420000.0  450000.0  89000.0          21000.0  45000.0  23000.0
S4           330000.0       NaN      NaN           5500.0      NaN      NaN

In [475]:
data = {
    "Item": ["Pen", "Pen", "Pencil", "Pencil", "Pen", "Pen"],
    "Color": ["Red", "Red", "Black", "Black", "Blue", "Blue"],
    "Price(Rs)": [10, 25, 7, 5, 50, 20],
    "Units_in_stock": [50, 10, 47, 34, 55, 14],
}

df = pd.DataFrame(data)
print(df)

     Item  Color  Price(Rs)  Units_in_stock
0     Pen    Red         10              50
1     Pen    Red         25              10
2  Pencil  Black          7              47
3  Pencil  Black          5              34
4     Pen   Blue         50              55
5     Pen   Blue         20              14

In [476]:
pivot3 = df.pivot(
    index="Item",
    columns="Color",
    values="Units_in_stock",
)

ValueError: Index contains duplicate entries, cannot reshape

```py
pandas.pivot_table(
    data,
    values=None,
    index=None,
    columns=None,
    aggfunc="mean",
)
```

In [98]:
df1 = df.pivot_table(index=["Item", "Color"])
print(df1)

              Price(Rs)  Units_in_stock
Item   Color
Pen    Blue        35.0            34.5
       Red         17.5            30.0
Pencil Black        6.0            40.5

In [103]:
pivot_table1 = df.pivot_table(
    index="Item",
    columns="Color",
    values="Units_in_stock",
    aggfunc=["sum", "max", "mean"],
)

pivot_table1

         sum               max              mean
Color  Black  Blue   Red Black  Blue   Red Black  Blue   Red
Item
Pen      NaN  69.0  60.0   NaN  55.0  50.0   NaN  34.5  30.0
Pencil  81.0   NaN   NaN  47.0   NaN   NaN  40.5   NaN   NaN

In [478]:
pivot_table1 = df.pivot_table(
    index="Item",
    columns="Color",
    values=["Price(Rs)", "Units_in_stock"],
    aggfunc={"Price(Rs)": len, "Units_in_stock": "mean"},
)

pivot_table1

       Price(Rs)           Units_in_stock
Color      Black Blue  Red          Black  Blue   Red
Item
Pen          NaN  2.0  2.0            NaN  34.5  30.0
Pencil       2.0  NaN  NaN           40.5   NaN   NaN

In [105]:
dfpen = df[df.Item == "Pen"]
pivot_redpen = dfpen.pivot_table(
    index="Item",
    columns=["Color"],
    values=["Price(Rs)"],
    aggfunc=["max"],
)

print(pivot_redpen)

            max
      Price(Rs)
Color      Blue Red
Item
Pen          50  25

In [107]:
import numpy as np

marksUT = {
    "Name": [
        "Raman",
        "Raman",
        "Raman",
        "Raman",
        "Zuhaire",
        "Zuhaire",
        "Zuhaire",
        "Zuhaire",
        "Ashravy",
        "Ashravy",
        "Ashravy",
        "Ashravy",
        "Mishti",
        "Mishti",
        "Mishti",
        "Mishti",
    ],
    "UT": [1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4],
    "Maths": [22, 21, 14, np.nan, 20, 23, 22, 19, 23, 24, 12, 15, 15, 18, 17, 14],
    "Science": [21, 20, 19, np.nan, 17, 15, 18, 20, 19, 22, 25, 20, 22, 21, 18, 20],
    "S.St": [18, 17, 15, 19, 22, 21, 19, 17, 20, 24, 19, 20, 25, 25, 20, 19],
    "Hindi": [20, 22, 24, 18, 24, 25, 23, 21, 15, 17, 21, 20, 22, 24, 25, 20],
    "Eng": [21, 24, 23, np.nan, 19, 15, 13, 16, 22, 21, 23, 17, 22, 23, 20, 18],
}

df = pd.DataFrame(marksUT)

print(df.isnull())

     Name     UT  Maths  Science   S.St  Hindi    Eng
0   False  False  False    False  False  False  False
1   False  False  False    False  False  False  False
2   False  False  False    False  False  False  False
3   False  False   True     True  False  False   True
4   False  False  False    False  False  False  False
5   False  False  False    False  False  False  False
6   False  False  False    False  False  False  False
7   False  False  False    False  False  False  False
8   False  False  False    False  False  False  False
9   False  False  False    False  False  False  False
10  False  False  False    False  False  False  False
11  False  False  False    False  False  False  False
12  False  False  False    False  False  False  False
13  False  False  False    False  False  False  False
14  False  False  False    False  False  False  False
15  False  False  False    False  False  False  False

In [108]:
print(df["Science"].isnull())

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
Name: Science, dtype: bool

In [109]:
print(df.isnull().any())

Name       False
UT         False
Maths       True
Science     True
S.St       False
Hindi      False
Eng         True
dtype: bool

In [110]:
print(df["Science"].isnull().any())

True

In [111]:
print(df["Hindi"].isnull().any())

False

In [112]:
print(df.isnull().sum())

Name       0
UT         0
Maths      1
Science    1
S.St       0
Hindi      0
Eng        1
dtype: int64

In [113]:
print(df.isnull().sum().sum())

3

In [115]:
dfRaman = df[df["Name"] == "Raman"]
print("Marks Scored by Raman:\n")
print(dfRaman)

Marks Scored by Raman:

    Name  UT  Maths  Science  S.St  Hindi   Eng
0  Raman   1   22.0     21.0    18     20  21.0
1  Raman   2   21.0     20.0    17     22  24.0
2  Raman   3   14.0     19.0    15     24  23.0
3  Raman   4    NaN      NaN    19     18   NaN

In [116]:
dfHindi = dfRaman["Hindi"]
print("Marks Scored by Raman in Hindi:\n")
print(dfHindi)

Marks Scored by Raman in Hindi:

0    20
1    22
2    24
3    18
Name: Hindi, dtype: int64

In [118]:
# Number of Unit Tests held. Here row will be 4
row = len(dfHindi)

print("Percentage of Marks Scored by Ramanin Hindi:\n")
print((dfHindi.sum() * 100) / (25 * row), "%", sep="")

Percentage of Marks Scored by Ramanin Hindi:

84.0%

In [120]:
dfMaths = dfRaman["Maths"]
print("Marks Scored by Raman in Maths:\n")
print(dfMaths)

Marks Scored by Raman in Maths:

0    22.0
1    21.0
2    14.0
3     NaN
Name: Maths, dtype: float64

In [121]:
# here, row will be 4,the number of Unit Tests
row = len(dfMaths)

print("Percentage of Marks Scored by Ramanin Maths\n")
print(dfMaths.sum() * 100 / (25 * row), "%", sep="")

Percentage of Marks Scored by Ramanin Maths

57.0%

In [122]:
df1 = df.dropna()
print(df1)

       Name  UT  Maths  Science  S.St  Hindi   Eng
0     Raman   1   22.0     21.0    18     20  21.0
1     Raman   2   21.0     20.0    17     22  24.0
2     Raman   3   14.0     19.0    15     24  23.0
4   Zuhaire   1   20.0     17.0    22     24  19.0
5   Zuhaire   2   23.0     15.0    21     25  15.0
6   Zuhaire   3   22.0     18.0    19     23  13.0
7   Zuhaire   4   19.0     20.0    17     21  16.0
8   Ashravy   1   23.0     19.0    20     15  22.0
9   Ashravy   2   24.0     22.0    24     17  21.0
10  Ashravy   3   12.0     25.0    19     21  23.0
11  Ashravy   4   15.0     20.0    20     20  17.0
12   Mishti   1   15.0     22.0    25     22  22.0
13   Mishti   2   18.0     21.0    25     24  23.0
14   Mishti   3   17.0     18.0    20     25  20.0
15   Mishti   4   14.0     20.0    19     20  18.0

In [123]:
# marks obtained by Raman in all the unit tests
dfRaman = df[df.Name == "Raman"]

# inplace=true makes changes in the originalDataFrame i.e. dfRaman here
dfRaman.dropna(inplace=True, how="any")

# get the marksscored in Maths
dfMaths = dfRaman["Maths"]

print("Marks Scored by Raman in Maths:\n")
print(dfMaths)

Marks Scored by Raman in Maths:

0    22.0
1    21.0
2    14.0
Name: Maths, dtype: float64

C:\Users\laksh\AppData\Local\Temp\ipykernel_16444\1986829903.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfRaman.dropna(inplace=True, how="any")

In [124]:
row = len(dfMaths)
print("Percentage of Marks Scored byRaman in Maths:\n")
print(dfMaths.sum() * 100 / (25 * row), "%", sep="")

Percentage of Marks Scored byRaman in Maths:

76.0%

In [125]:
# Marks Scored by Raman in all the subjects across the tests
dfRaman = df.loc[df["Name"] == "Raman"]
(row, col) = dfRaman.shape

dfScience = dfRaman.loc[:, "Science"]
print("Marks Scored by Raman in Science:\n")
print(dfScience)

Marks Scored by Raman in Science:

0    21.0
1    20.0
2    19.0
3     NaN
Name: Science, dtype: float64

In [126]:
dfFillZeroScience = dfScience.fillna(0)

print("Marks Scored by Raman in Science with Missing Values Replaced with Zero:\n")
print(dfFillZeroScience)

Marks Scored by Raman in Science with Missing Values Replaced with Zero:

0    21.0
1    20.0
2    19.0
3     0.0
Name: Science, dtype: float64

In [127]:
print("Percentage of Marks Scored by Raman in Science:\n")
print(dfFillZeroScience.sum() * 100 / (25 * row), "%", sep="")

Percentage of Marks Scored by Raman in Science:

60.0%

In [129]:
dfEng = dfRaman.loc[:, "Eng"]
print("Marks Scored by Raman in English:\n")
print(dfEng)

Marks Scored by Raman in English:

0    21.0
1    24.0
2    23.0
3     NaN
Name: Eng, dtype: float64

In [133]:
dfFillPadEng = dfEng.ffill()
print(
    "Marks Scored by Raman in English with Missing Values Replaced by Previous Test Marks:\n"
)
print(dfFillPadEng)

Marks Scored by Raman in English with Missing Values Replaced by Previous Test Marks:

0    21.0
1    24.0
2    23.0
3    23.0
Name: Eng, dtype: float64

In [134]:
print("Percentage of Marks Scored by Raman in English:\n")
print(dfFillPadEng.sum() * 100 / (25 * row), "%", sep="")

Percentage of Marks Scored by Raman in English:

91.0%